{
  "irVersion": "1.0",
  "project": "omni-livekit",
  "repository": "https://github.com/plexusone/omni-livekit",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["plexusone"],
  "releases": [
    {
      "version": "v0.4.0",
      "date": "2026-07-12",
      "highlights": [
        { "description": "OmniAvatar integration for unified avatar provider abstraction" },
        { "description": "Avatar configuration in agent options for HeyGen, Tavus, and bitHuman" },
        { "description": "LiveKit adapter wrapping omniavatar sessions with DataStream audio" }
      ],
      "added": [
        { "description": "`avatar.LiveKitSession` adapter wrapping omniavatar sessions", "commit": "a490c2b" },
        { "description": "`avatar.WrapSession()` for adapting omniavatar sessions to LiveKit", "commit": "a490c2b" },
        { "description": "`avatar.StartOptions` with Room, AgentIdentity, and LiveKit credentials", "commit": "a490c2b" },
        { "description": "`agent.AvatarConfig` for provider selection", "commit": "f2b0b5f" },
        { "description": "`agent.HeyGenAvatarConfig` with sandbox and video quality options", "commit": "f2b0b5f" },
        { "description": "`agent.TavusAvatarConfig` with PAL and face ID options", "commit": "f2b0b5f" },
        { "description": "`agent.BitHumanAvatarConfig` with agent ID", "commit": "f2b0b5f" },
        { "description": "`Agent.AvatarSession()` for accessing the active avatar session", "commit": "bf7cc59" },
        { "description": "`Agent.AvatarAudioOutput()` for streaming TTS to avatar", "commit": "bf7cc59" },
        { "description": "`Agent.HasAvatar()` for checking avatar availability", "commit": "bf7cc59" }
      ],
      "dependencies": [
        { "description": "`github.com/plexusone/omniavatar` v0.1.0", "commit": "ac2b3c4" },
        { "description": "`github.com/plexusone/omniavatar-core` v0.1.0", "commit": "ac2b3c4" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-07-11",
      "commit": "baf395c",
      "highlights": [
        { "description": "bitHuman avatar provider for real-time animated avatars" },
        { "description": "Provider-agnostic factory pattern with auto-registration" },
        { "description": "Comprehensive avatar providers comparison guide" }
      ],
      "added": [
        { "description": "Avatar provider factory with registry pattern for provider-agnostic session creation", "commit": "b6b159c" },
        { "description": "Avatar setup utilities for session initialization", "commit": "aa1e761" },
        { "description": "Tavus provider auto-registration via init()", "commit": "492adec" },
        { "description": "bitHuman avatar provider with LiveKit integration", "commit": "965766a" },
        { "description": "bitHuman client wrapper over bithuman-go SDK", "commit": "965766a" },
        { "description": "DataStream audio output for bitHuman lip-sync", "commit": "965766a" },
        { "description": "`Agent.Room()` method for avatar session integration", "commit": "7367f27" }
      ],
      "documentation": [
        { "description": "Avatar providers comparison guide (Tavus, HeyGen, D-ID, bitHuman, Simli)", "commit": "19243f6" },
        { "description": "Updated avatar API reference with factory pattern", "commit": "f76c101" },
        { "description": "Updated Tavus guide with registration details", "commit": "f76c101" },
        { "description": "README updates with avatar features", "commit": "cb2e27c" }
      ],
      "dependencies": [
        { "description": "github.com/plexusone/bithuman-go v0.1.0", "commit": "baf395c" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-07-06",
      "commit": "946ab25",
      "highlights": [
        { "description": "Lip-sync avatar support via Tavus CVI integration" },
        { "description": "tavus-go SDK integration for type-safe Tavus API access" },
        { "description": "Voice-to-voice support for lower latency with Deepgram, Google, and OpenAI" }
      ],
      "added": [
        { "description": "Avatar package with session interface and audio streaming", "commit": "946ab25" },
        { "description": "Tavus provider implementation using tavus-go SDK", "commit": "946ab25" },
        { "description": "DataStreamAudioOutput for LiveKit ByteStream integration", "commit": "946ab25" },
        { "description": "QueueAudioOutput for local testing", "commit": "946ab25" },
        { "description": "Token generation with `lk.publish_on_behalf` capability", "commit": "946ab25" },
        { "description": "Error types and metrics collection for avatar sessions", "commit": "946ab25" }
      ],
      "documentation": [
        { "description": "Voice pipeline documentation with STT → LLM → TTS architecture", "commit": "946ab25" },
        { "description": "Voice-to-voice option documentation for lower latency", "commit": "946ab25" }
      ],
      "dependencies": [
        { "description": "github.com/plexusone/tavus-go v0.2.0" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-07-05",
      "highlights": [
        { "description": "Initial release of omni-livekit - LiveKit voice gateway for WebRTC-based voice AI applications" },
        { "description": "OmniMeet provider implementation for LiveKit meeting abstraction" },
        { "description": "OmniVoice gateway for voice AI pipeline integration" },
        { "description": "Static image avatar support for voice agents with 16:9 canvas" }
      ],
      "added": [
        { "description": "LiveKit agent package with WebRTC audio track handling", "commit": "109218b" },
        { "description": "Room management for creating rooms and generating client tokens", "commit": "a97e6f5" },
        { "description": "OmniMeet provider implementing `meeting.Provider` interface", "commit": "f445405" },
        { "description": "OmniVoice gateway implementing `WebRTCGateway` interface", "commit": "7a15e25" },
        { "description": "Static image avatar support for voice agents", "commit": "2cd92d5" },
        { "description": "`encode-avatar` tool for pre-encoding avatar images to H.264", "commit": "955ef25" },
        { "description": "Embedded default OmniAgent avatar", "commit": "6069730" },
        { "description": "`AGENT_AVATAR` environment variable for avatar configuration", "commit": "8e519d0" },
        { "description": "16:9 canvas support for LiveKit UI compatibility", "commit": "b171fbf" },
        { "description": "High-quality bicubic scaling for avatar encoding", "commit": "fbe3e35" }
      ],
      "documentation": [
        { "description": "Getting started guide and quick start tutorial", "commit": "ee30a05" },
        { "description": "Opus build tag requirements and troubleshooting guide", "commit": "66da57f" },
        { "description": "Voice pipeline architecture documentation", "commit": "b16ea76" },
        { "description": "Avatar architecture and usage documentation", "commit": "127c106" },
        { "description": "Comprehensive environment variables reference", "commit": "751cc08" },
        { "description": "Human participation guide for LiveKit Meet integration", "commit": "ee30a05" },
        { "description": "API reference for Gateway, Room, and Agent packages", "commit": "ee30a05" }
      ],
      "fixed": [
        { "description": "CI workflow with native dependencies (libopus, libsoxr)", "commit": "8a53efe" },
        { "description": "Default avatar dimensions for LiveKit UI fit", "commit": "a598517" }
      ],
      "dependencies": [
        { "description": "github.com/livekit/server-sdk-go/v2 v2.17.0" },
        { "description": "github.com/plexusone/omnimeet-core v0.8.0" },
        { "description": "github.com/plexusone/omnivoice v0.13.0" },
        { "description": "github.com/plexusone/omnivoice-core v0.15.0" }
      ]
    }
  ]
}
